Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: From the output above one can see that, in addition to the produced jar file and the associated lib directory, a text file named `native-image.args` was created. This file holds all parameters (including the name of the JAR to compile) to pass along to GraalVM's `native-image` command. A text file named `graalvm.version` was also created and holds the GraalVM version that should be used. If you have GraalVM installed and it matches this version, you can start the native compilation by executing:
ja_jp: 上記の出力から、生成された jar ファイルと関連する lib ディレクトリーに加えて、 `native-image.args` という名前のテキストファイルが作成されたことがわかります。 このファイルには、GraalVM の `native-image` コマンドに渡すすべてのパラメーター (コンパイルする JAR の名前を含む) が保持されます。 `graalvm.version` という名前のテキストファイルも作成され、使用する GraalVM のバージョンが保持されます。 GraalVM がインストールされていて、このバージョンと一致する場合は、次のコマンドを実行してネイティブコンパイルを開始できます。

source: From the output above one can see that, in addition to the produced jar file and the associated lib directory, a text file named `native-image.args` was created. This file holds all parameters (including the name of the JAR to compile) to pass along to GraalVM's `native-image` command. If you have GraalVM installed, you can start the native compilation by executing:
ja_jp: 上記の出力から、生成された jar ファイルと関連する lib ディレクトリに加えて、 `native-image.args` という名前のテキストファイルが作成されたことがわかります。このファイルは、GraalVM の `native-image` コマンドに渡すすべてのパラメーター (コンパイルする JAR の名前を含む) を保持します。GraalVM がインストールされている場合は、以下を実行してネイティブコンパイルを開始できます:

source: From the outset, Quarkus has been designed around a container-first philosophy. What this means in concrete terms is that Quarkus applications are optimised for low memory usage and fast startup times in the following ways:
ja_jp: Quarkus は、当初からコンテナーファーストの理念に基づいて設計されています。具体的には、Quarkus アプリケーションは、以下のようにメモリー使用量が少なく、起動時間が短くなるように最適化されています。

source: From the practical point of view, your Quarkus endpoint will most likely need to have the `quarkus.oidc.authentication.redirect-path` relative path property set to an initial entry path for all the authenticated users, for example, `quarkus.oidc.authentication.redirect-path=/authenticated`, which means that newly authenticated users will land on the `/authenticated` page, irrespectively of how many secured entry points your application has and which secured resource they initially accessed.
ja_jp: 実用的な観点から言えば、Quarkus エンドポイントでは、 `quarkus.oidc.authentication.redirect-path` 相対パスプロパティーを、すべての認証済みユーザーの初期エントリーパスに設定する必要があります (例: `quarkus.oidc.authentication.redirect-path=/authenticated`)。つまり、アプリケーションのセキュリティー保護されたエントリーポイントの数や、最初にアクセスしたセキュリティー保護されたリソースに関係なく、新しく認証されたユーザーは `/authenticated` ページに移動します。

source: From the previous step, our service is now running in OpenShift, but we didn't configure anything in Prometheus to scrape our service yet. This is done by the Service Monitor resource:
ja_jp: 前のステップから、サービスは OpenShift で実行されていますが、Prometheus でサービスをスクレイプするための設定はまだ何もしていません。これは Service Monitor リソースで行います。

source: From the user point of view, the main difference between RESTEasy _classic_ and _reactive_ is how they call the HTTP endpoint methods:
ja_jp: ユーザーの視点から見ると、RESTEasyの _classic_と _reactive_ の主な違いは、HTTPエンドポイントのメソッドの呼び出し方です。

source: From there, you can either inspect the executable directly or use a tools container like above.
ja_jp: そこから、実行ファイルを直接検査するか、上記のようなツールコンテナーを使用することができます。

source: From there, you can narrow down to a given method on a specific type:
ja_jp: そこから、特定の型の特定のメソッドに絞ることができます。

source: From time to time, I see tweets or articles claiming they don't see the point of Quarkus because "who needs fast startup?", "I have plenty of memory" or "what is the point of live reload?".
ja_jp: 時折、「誰が高速起動を必要としているのか」、「メモリは十分にある」、「ライブリロードの意味は何か」といった理由で、Quarkusの必要性が理解できないと主張するツイートや記事を目にすることがあります。

source: From time to time, we had users complaining about the unavailability of a particular property (and the workaround was to push this property to a `persistence.xml` but it was not ideal). Then, there were two options: either we decided to expose them in a future version of Quarkus or we decided we didn't want to expose them - at least not for now - and that might have been impractical in some use cases.
ja_jp: 時折、特定のプロパティが利用できないことに不満を持つユーザーがいました（回避策として、このプロパティを `persistence.xml` にプッシュする方法がありましたが、理想的ではありませんでした）。そこで、2つの選択肢がありました。Quarkusの将来のバージョンで公開することにするか、公開しないことにするか（少なくとも今のところは）、ユースケースによっては非現実的なことになるかもしれなかったからです。

source: From web dependencies like webjars or mvnpm
ja_jp: webjars や mvnpm などの Web 依存関係から

source: From {project-name} 3.8, the `DeploymentConfig` object, deprecated in OpenShift, is also deprecated in {project-name}. `Deployment` is the default and preferred deployment kind for the `quarkus-openshift` extension. If you redeploy applications that you deployed before by using `DeploymentConfig`, by default, those applications use `Deployment` but do not remove the previous `DeploymentConfig`. This leads to a deployment of both new and old applications, so, you must remove the old `DeploymentConfig` manually. However, if you want to continue to use `DeploymentConfig`, it is still possible to do so by explicitly setting `quarkus.openshift.deployment-kind` to `DeploymentConfig`.
ja_jp: {project-name} 3.8以降、OpenShiftで非推奨となっている `DeploymentConfig` オブジェクトは、 {project-name} でも非推奨となっています。 `Deployment` は、 `quarkus-openshift` エクステンションのデフォルトで優先されるデプロイの種類です。以前 `DeploymentConfig` を使用してデプロイしたアプリケーションを再デプロイする場合、デフォルトでは、それらのアプリケーションは `Deployment` を使用しますが、以前の `DeploymentConfig` は削除されません。 そのため、古い `DeploymentConfig` を手動で削除する必要があります。ただし、 `DeploymentConfig` を使い続けたい場合は、 `quarkus.openshift.deployment-kind` を `DeploymentConfig` に明示的に設定することで可能です。

source: Front-Channel Logout
ja_jp: フロントチャネルログアウト

source: Front-channel logout
ja_jp: フロントチャネルログアウト

source: Front-channel logout is conceptually similar to the <<back-channel-logout>> but the notifications are forwarded to Quarkus via the browser. See the xref:security-oidc-code-flow-authentication.adoc#front-channel-logout[OIDC Front-channel logout] section for more details.
ja_jp: フロントチャネルログアウトは、概念的には <<back-channel-logout>> と似ていますが、通知がブラウザー経由で Quarkus に転送される点が異なります。詳細は xref:security-oidc-code-flow-authentication.adoc#front-channel-logout[OIDC フロントチャネルログアウト] セクションを参照してください。

source: Front-channel logout path
ja_jp: フロントチャネルログアウトパス

source: Front-channel logout properties
ja_jp: フロントチャネルログアウトプロパティー

source: Front-end developers are comfortable enough with Quarkus to be able to read the code, at least, and can help with debugging or testing:
ja_jp: フロントエンドの開発者は、少なくともコードを読むことができる程度にはQuarkusに慣れており、デバッグやテストを手伝うことができます。

source: Frozen RAG (Retrieval-Augmented Generation)
ja_jp: Frozen RAG (検索拡張生成)

source: Frozen RAG ingestion image
ja_jp: Frozen RAG 取り込みイメージ

source: Frozen RAG query image
ja_jp: Frozen RAG クエリイメージ

source: Full
ja_jp: 完全

source: Full Changelog
ja_jp: 完全な変更履歴

source: Full Java 25 support
ja_jp: フルJava 25サポート

source: Full Message
ja_jp: フルメッセージ

source: Full changelog
ja_jp: 完全な変更履歴

source: Full compliance with the 1.0 TCK test suite
ja_jp: 1.0 TCK テストスイートへの完全な準拠

source: Full support for Java 25
ja_jp: Java 25のフルサポート

source: Full-page templates for extensions live under a pre-defined `{devRootAppend}/{groupId}.{artifactId}/` directory that is referenced using the `urlbase` template parameter. Using configuration defaults, that would resolve to `/q/dev-v1/io.quarkus.quarkus-cache/`, as an example.
ja_jp: エクステンションのフルページテンプレートは、 `urlbase` テンプレートパラメータを使用して参照される、定義済の `{devRootAppend}/{groupId}.{artifactId}/` ディレクトリの下にあります。例として、設定のデフォルトを使用すると、 `/q/dev-v1/io.quarkus.quarkus-cache/` に解決されます。

source: Full-page templates for extensions live under a pre-defined `{devRootAppend}/{groupId}.{artifactId}/` directory that is referenced using the `urlbase` template parameter. Using configuration defaults, that would resolve to `/q/dev/io.quarkus.quarkus-cache/`, as an example.
ja_jp: エクステンションのフルページテンプレートは、 `urlbase` template パラメータで参照されるあらかじめ定義された `{devRootAppend}/{groupId}.{artifactId}/` ディレクトリの下に配置されます。設定のデフォルトでは、例えば `/q/dev/io.quarkus.quarkus-cache/` となります。

source: Full-stack microservices (Micro-frontends)
ja_jp: フルスタックマイクロサービス (マイクロフロントエンド)

source: Fully static native executables support is experimental.
ja_jp: 完全に静的なネイティブ実行可能ファイルのサポートは実験的なものです。

source: Function Names
ja_jp: ファンクション名

source: Function return type can also be Mutiny reactive types.
ja_jp: 関数の戻り値の型は、Mutiny 反応型も可能です。

source: Functional tests
ja_jp: 機能テスト

source: Functions as a Service and Serverless
ja_jp: Functions as a Service とサーバーレス

source: Funqy AWS Lambda Binding
ja_jp: Funqy AWS Lambdaバインディング

source: Funqy AWS Lambda support leverages the Quarkus AWS Lambda test framework so that you can unit tests your Funqy functions. This is true for both JVM and native modes. This test framework provides similar functionality to the SAM CLI, without the overhead of Docker.
ja_jp: Funqy の AWS Lambda サポートは、Quarkus AWS Lambda テストフレームワークを利用して、Funqy 関数のユニットテストを可能にします。これは、JVM とネイティブモードの両方に当てはまります。このテストフレームワークは、Docker のオーバーヘッドなしで、SAM CLI と同様の機能を提供します。

source: Funqy AWS Lambdas build off of our xref:aws-lambda.adoc[Quarkus AWS Lambda support].
ja_jp: Funqy AWS Lambdas は、xref:aws-lambda.adoc[Quarkus AWS Lambda サポート] に基づき構築されています。

source: Funqy Amazon Lambda Binding
ja_jp: Funqy Amazon Lambda バインディング

source: Funqy Amazon Lambda support leverages the Quarkus AWS Lambda test framework so that you can unit tests your Funqy functions. This is true for both JVM and native modes. This test framework provides similar functionality to the SAM CLI, without the overhead of Docker.
ja_jp: Funqy の Amazon Lambda サポートは、Quarkus AWS Lambda テストフレームワークを利用して、Funqy 関数をユニットテストできるようにします。これは、JVM とネイティブモードの両方に当てはまります。このテストフレームワークは、Docker のオーバーヘッドなしで、SAM CLI と同様の機能を提供します。

source: Funqy Amazon Lambdas build off of our xref:amazon-lambda.adoc[Quarkus Amazon Lambda support].
ja_jp: Funqy Amazon Lambda は、xref:amazon-lambda.adoc[Quarkus Amazon Lambda サポート] を基に構築されています。

source: Funqy Basics
ja_jp: Funqy の基礎

source: Funqy HTTP Binding (Standalone)
ja_jp: Funqy HTTPバインディング (スタンドアロン)

source: Funqy HTTP Binding with AWS Lambda
ja_jp: Funqy HTTPバインディングとAWS Lambda

source: Funqy HTTP Binding with Amazon Lambda
ja_jp: Amazon Lambda用Funqy HTTPバインディング

source: Funqy HTTP Binding with Azure Functions
ja_jp: Azure Functions と Funqy HTTP バインディング

source: Funqy HTTP Binding with Google Cloud Functions
ja_jp: Google Cloud Functionsを使用した Funqy HTTP バインディング

source: Funqy Knative Events Binding
ja_jp: Funqy Knative Events バインディング

source: Funqy Knative Events support dev mode and unit testing using RestAssured. You can invoke on Funqy Knative Events functions using the same invocation model as xref:funqy-http.adoc[Funqy HTTP] using normal HTTP requests, or Cloud Event Binary mode, or Structured Mode. All invocation modes are supported at the same time.
ja_jp: Funqy Knative Eventsは、RestAssuredを使った開発モードとユニットテストをサポートしています。Funqy Knative Eventsの関数は、通常のHTTPリクエストを使った link:funqy-http.html[Funqy HTTP]と同じ呼び出しモデル、またはCloud Event Binaryモード、Structuredモードを使って呼び出すことができます。すべての呼び出しモードが同時にサポートされています。

source: Funqy also works with Quarkus Dev mode!
ja_jp: FunqyはQuarkus 開発モードにも対応しています!

source: Funqy and Cloud Events
ja_jp: Funqy と Cloud Events

source: Funqy functions can be deployed using the AWS Lambda Java Runtime, or you can build a native executable and use Lambda Custom Runtime if you want a smaller memory footprint and faster cold boot startup time.
ja_jp: Funqy関数はAWS Lambda Java Runtimeを使ってデプロイすることもできますし、より少ないメモリーフットプリントとより高速なコールドブート起動時間が必要な場合は、ネイティブ実行可能ファイルをビルドしてLambda Custom Runtimeを使うこともできます。

source: Funqy supports the https://smallrye.io/smallrye-mutiny[SmallRye Mutiny] `Uni` reactive type as a return type. The only requirement is that the `Uni` must fill out the generic type.
ja_jp: Funqyは link:https://smallrye.io/smallrye-mutiny[SmallRye Mutiny] `Uni` のリアクティブ型を戻り値の型としてサポートしています。唯一の条件は、 `Uni` 、ジェネリック型を記入することです。

source: Funqy supports the https://smallrye.io/smallrye-mutiny[Smallrye Mutiny] `Uni` reactive type as a return type. The only requirement is that the `Uni` must fill out the generic type.
ja_jp: Funqyは戻り値の型として link:https://smallrye.io/smallrye-mutiny[Smallrye Mutiny] `Uni` リアクティブ型をサポートしています。唯一の要件は、 `Uni` がジェネリック型を保持しなければならないことです。

source: Further Patterns
ja_jp: さらなるパターン

source: Further Reports
ja_jp: 更なるレポート

source: Further docs explain how to enable and use each of them.
ja_jp: それぞれの有効化と使用方法については、さらにドキュメントで説明しています。

source: Further improvements: Database and UI integration
ja_jp: さらなる改善: データベースと UI の統合

source: Further patterns in Chain-of-Thought reasoning extend beyond basic single-prompt approaches to offer more sophisticated control and integration. "Single-prompt CoT" provides a concise way to elicit reasoning, where a single instruction like "think step by step" guides the LLM to return both its thought process and the final answer.
ja_jp: Chain-of-Thought 推論におけるさらなるパターンは、基本的なシングルプロンプトのアプローチを超えて、より洗練された制御と統合を提供します。「シングルプロンプト CoT」は、たとえば「段階的に考える」といった単一の指示によって LLM が思考プロセスと最終回答の両方を返すように導く、簡潔な推論の引き出し方を提供します。

source: Further reading
ja_jp: さらに詳しく

source: Further security with Proof Key for Code Exchange (PKCE)
ja_jp: Proof Key for Code Exchange (PKCE) を使用したセキュリティー強化

source: Further simplification with `@InjectMock`
ja_jp: `@InjectMock` での更なる単純化

source: Further, the load shedding implementation is currently rather basic and not heavily tested in production. Improvements may be necessary.
ja_jp: さらに、負荷制限の実装は現時点ではかなり基本的なものであり、実稼働環境で十分にテストされていません。 改善が必要になる可能性があります。

source: Furthermore, OptaPlanner needs to know which `Lesson` instances it can change as well as how to retrieve the `Timeslot` and `Room` instances used for score calculation by your `TimeTableConstraintProvider`.
ja_jp: さらに、OptaPlanner は、変更できる `Lesson` インスタンスと、 `TimeTableConstraintProvider` がスコア計算に使用する `Timeslot` および `Room` インスタンスを取得する方法を知る必要があります。

source: Furthermore, `@TemplateData.properties()` and `@TemplateData.ignore()` can be used to fine-tune the generated resolver. Finally, it is also possible to specify the "target" of the annotation - this could be useful for third-party classes not controlled by the application:
ja_jp: さらに、 `@TemplateData.properties()` と `@TemplateData.ignore()` を使用して、生成されるリゾルバを微調整することができます。最後に、アノテーションの「ターゲット」を指定することも可能です。これは、アプリケーションによって管理されないサードパーティーのクラスに便利です。

source: Furthermore, a special message method is generated for each enum constant. Finally, each localized file must contain keys and values for all enum constants:
ja_jp: さらに、各列挙定数に対して特別なメッセージメソッドが生成されます。 最後に、ローカライズされた各ファイルには、すべての定数メッセージキーのキーと値が含まれている必要があります。

source: Furthermore, classes annotated with `@ConfigProperties` can be annotated with Bean Validation annotations:
ja_jp: さらに、 `@ConfigProperties` でアノテーションされたクラスには、Bean Validationアノテーションを付けることができます。

source: Furthermore, client proxies only delegate method invocations and thus you should never read/write fields of an injected `@ApplicationScoped` bean directly. You can read/write fields of an injected `@Singleton` safely.
ja_jp: さらに、クライアントプロキシーはメソッドの呼び出しを委譲するだけなので、注入された `@ApplicationScoped` Bean のフィールドを直接読み書きしてはいけません。注入された `@Singleton` のフィールドは安全に読み書きすることができます。

source: Furthermore, extensions can eliminate false positives by producing an `UnremovableBeanBuildItem`.
ja_jp: さらに、エクステンションは `UnremovableBeanBuildItem` を生成することで、可能性のある誤検出を排除することができます。

source: Furthermore, if filters need to perform blocking operations, then they can return `Uni<Void>` and RESTEasy Reactive will not block the event-loop thread while executing the filter.
ja_jp: さらに、フィルタがブロッキング操作を行う必要がある場合は `Uni<Void>` を返すことができ、RESTEasy Reactive はフィルタを実行している間はイベントループスレッドをブロックしません。

source: Furthermore, if you must replace the default `ObjectMapper` bean used by the Kubernetes Client that the extension creates automatically, you can do so by declaring a bean of type `@KubernetesClientObjectMapper`. The following code snippet shows how you can declare this bean:
ja_jp: さらに、エクステンションが自動的に作成する Kubernetes Client が使用するデフォルトの `ObjectMapper` Bean を置き換える必要がある場合は、 `@KubernetesClientObjectMapper` 型の Bean を宣言することで置き換えることができます。次のコードスニペットは、このBeanを宣言する方法を示しています：

source: Furthermore, if you need the full control over the `QuarkusComponentTestExtension` configuration then you can use the `@RegisterExtension` annotation and configure the extension programmatically.
ja_jp: さらに、 `QuarkusComponentTestExtension` 設定を完全に制御する必要がある場合は、 `@RegisterExtension` アノテーションを使用して、プログラムによってエクステンションを設定できます。

source: Furthermore, it is possible to inject the `HttpServerRequest` parameters into a method parameter annotated with `@io.quarkus.vertx.web.Param`:
ja_jp: さらに、 `HttpServerRequest` パラメーターを `@io.quarkus.vertx.web.Param` でアノテーションされたメソッドパラメーターに挿入できます。

source: Furthermore, it is possible to inject the `HttpServerRequest` parameters into method parameters annotated with `@io.quarkus.vertx.web.Param` using the following types:
ja_jp: さらに、 `HttpServerRequest` パラメーターを以下の型を使用した `@io.quarkus.vertx.web.Param` でアノテーションされたメソッドパラメーターに挿入できます。

source: Furthermore, some operations undertaken by this extension need special access, it is necessary to
ja_jp: また、このエクステンションで行う作業の中には、特別なアクセスが必要なものがあります、次のことが必要になります

source: Furthermore, the _quarkus-jaxrs-client_ extension can be used if you need to use the JAX-RS client (this is not the declarative MicroProfile REST Client, but the programmatic client specified by the JAX-RS spec).
ja_jp: さらに、JAX-RSクライアントを使用する必要がある場合は、_quarkus-jaxrs-client_ エクステンションを使用することができます (これは宣言型MicroProfile RESTクライアントではなく、JAX-RS仕様で定義されたプログラマティッククライアントです)。

source: Furthermore, the `ObjectMapper` is configured to format dates and time in ISO-8601 (by disabling the `SerializationFeature.WRITE_DATES_AS_TIMESTAMPS` feature).
ja_jp: さらに、 `ObjectMapper` 、日付と時刻をISO-8601でフォーマットするように設定されています（ `SerializationFeature.WRITE_DATES_AS_TIMESTAMPS` の機能を無効にすることで）。

source: Furthermore, the annotated method must return `void` and either declare no parameters or one parameter of type `io.quarkus.scheduler.ScheduledExecution`.
ja_jp: さらに、アノテーションされたメソッドは `void` を返し、パラメーターを宣言しないか、 `io.quarkus.scheduler.ScheduledExecution` 型のパラメーターを 1 つだけ宣言する必要があります。

source: Furthermore, the client can also send arbitrarily large files if one of the following types is used:
ja_jp: さらに、次のいずれかの型を使用すると、クライアントは任意の大きさのファイルを送信することもできます。

source: Furthermore, the configuration classes support nested object configuration. Suppose there was a need to have an extra layer of greeting configuration named `content` that would contain a few fields:
ja_jp: さらに、設定クラスはネストされたオブジェクト設定をサポートしています。例えば、 `content` という名前のグリーティングの設定を追加で用意する必要があり、その中にはいくつかのフィールドが含まれているとします。

source: Furthermore, the following dependency needs to be added
ja_jp: さらに、以下の依存関係を追加する必要があります。

source: Furthermore, using Quarkus REST (formerly RESTEasy Reactive), our default REST layer, does not require the use of Hibernate Reactive. It is perfectly valid to use Quarkus REST with Hibernate ORM, and if you do not need high-concurrency, or are not accustomed to the reactive paradigm, it is recommended to use Hibernate ORM.
ja_jp: さらに、デフォルトの REST レイヤーである Quarkus REST (旧称 RESTEasy Reactive) を使用する場合、Hibernate Reactive を使用する必要はありません。 Quarkus REST を Hibernate ORM と併用することはまったく問題ありません。 高い同時実行性が必要ない場合、またはリアクティブパラダイムに慣れていない場合は、Hibernate ORM を使用することを推奨します。

source: Furthermore, when comparing our results to other competing enterprise Java frameworks that provide annotation based REST layers, Quarkus provided as much as double the throughput depending on the benchmark.
ja_jp: さらに、アノテーションベースのRESTレイヤーを提供する他の競合するエンタープライズJavaフレームワークと結果を比較すると、ベンチマークによっては、Quarkusは2倍ものスループットを提供しました。

source: Furthermore, when multiple ConfigMaps (or Secrets) are used, ConfigMaps (or Secrets) defined later in the list have a higher priority than ConfigMaps (or Secrets) defined earlier in the list.
ja_jp: さらに、複数のConfigMap (またはSecret) を使用する場合、リストの後半で定義されたConfigMap (またはSecret) は、リストの前半で定義されたConfigMap (またはSecret) よりも優先度が高くなります。

source: Furthermore, when multiple ConfigMaps (or Secrets) are used, ConfigMaps (or Secrets) defined later in the list have a higher priority that ConfigMaps defined earlier in the list.
ja_jp: さらに、複数のConfigMap(またはSecret)を使用している場合、後から定義されたConfigMap(またはSecret)は、先に定義されたConfigMap(またはSecret)よりも優先度が高くなります。

source: Furthermore, worth noting is that the first release will not contain an implementation of the MicroProfile REST Client based on the new JAX-RS Client (for which there is a dedicated extension). This will most likely change in the near future.
ja_jp: さらに、最初のリリースには、 (専用のエクステンションが存在する) 新しい JAX-RS Clientをベースにした MicroProfile REST Client の実装が含まれていないことも注目に値する。これは近い将来に変更される可能性が高い。

source: Furthermore, you can also use Maven Snapshots (as Quarkus snapshot builds are uploaded to Sonatype once a day), by specifying version `999-SNAPSHOT` as the Quarkus version and using `quarkus-bom` instead of `quarkus-universe-bom` as the BOM. There are various ways to enable snapshot versions in Maven. https://stackoverflow.com/a/7717234/2504224[This] StackOverflow answer shows configuration that can be used either on a per project basis or globally.
ja_jp: さらに、バージョン `999-SNAPSHOT` をQuarkusのバージョンとして指定し、BOMとして `quarkus-universe-bom` の代わりに `quarkus-bom` を使用することで、Mavenのスナップショットを使用することもできます(Quarkusのスナップショットビルドは1日1回Sonatypeにアップロードされるため)。 Mavenでスナップショットバージョンを有効にするには、さまざまな方法があります。 https://stackoverflow.com/a/7717234/2504224[This] StackOverflowの回答では、プロジェクト単位でもグローバルでも使える設定が示されています。

source: Future versions of Quarkus will configure the Kotlin compiler plugin in a way that will make it unnecessary to alter this configuration.
ja_jp: Quarkusの将来のバージョンでは、この設定を変更する必要がないようにKotlinコンパイラプラグインを設定するようになる予定です。

source: G -> https://github.com/grafana/grafana[Grafana] (metrics visualization)
ja_jp: G -> https://github.com/grafana/grafana[Grafana] (メトリクスの可視化)

source: GC Collection Policy
ja_jp: GCコレクションポリシー

source: GC Logging
ja_jp: GCロギング

source: GELF alternative: use Syslog
ja_jp: GELFの代替:Syslogの使用

source: GET Query Parameter Mapping
ja_jp: GET クエリパラメーターのマッピング

source: GETs should not change application state.
ja_jp: GET はアプリケーションの状態を変更できません。

source: GZip Support
ja_jp: GZipのサポート

source: Garbage Collectors
ja_jp: ガベージコレクター

source: Garbage collection
ja_jp: ガベージコレクション

source: Gather build time metadata and generate code
ja_jp: ビルド時のメタデータを収集し、コードを生成

source: Gather the domain objects in a planning solution
ja_jp: プランニングソリューションでドメインオブジェクトを収集します

source: Gauge
ja_jp: ゲージ

source: Gauge values are sampled rather than set; there is no record of how the value associated with a gauge may have changed between measurements.
ja_jp: ゲージの値は設定されずにサンプリングされます。 測定間でゲージに関連付けられた値がどのように変化したかについての記録はありません。

source: Gauges
ja_jp: ゲージ

source: Gauges measure a value that can increase or decrease over time, like the speedometer on a car. Gauges can be useful when monitoring the statistics for a cache or collection.
ja_jp: ゲージは、車のスピードメーターのように、時間の経過とともに増加または減少する値を測定します。 ゲージは、キャッシュまたはコレクションの統計を監視するときに役立ちます。

source: Gauges measure a value that can increase or decrease over time, like the speedometer on a car. The value of a gauge is not accumulated, it is observed at collection time. Use a gauge to observe the size of a collection, or the value returned from a function.
ja_jp: ゲージは、車のスピードメーターのように、時間とともに増減する値を測定します。 ゲージの値は蓄積されず、収集時に観察されます。 ゲージを使用して、コレクションのサイズや関数から返される値を観察します。

source: Gauges measure a value that can increase or decrease over time, like the speedometer on a car. Gauges can be useful when monitoring the statistics for a cache or collection. Consider the following simple example that observes the size of a list:
ja_jp: ゲージは、車のスピードメーターのように、時間の経過とともに増えたり減ったりする値を測定するものです。ゲージは、キャッシュやコレクションの統計情報を監視する際に便利です。次の簡単な例では、リストのサイズを監視しています。

source: General Guides
ja_jp: 一般ガイド

source: General case
ja_jp: 一般的なケース

source: General overview
ja_jp: 全般的な概要

source: General text
ja_jp: 一般テキスト
